Revit 2027 API
BuiltInFailures.SketchFailures.TrussClosedReference Property
 Truss references (chains of one or more reference lines) should not form closed loops."
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId TrussClosedReference { get; }
Public Shared ReadOnly Property TrussClosedReference As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ TrussClosedReference {
	FailureDefinitionId^ get ();
}
static member TrussClosedReference : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace